Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh9-v3.tmx
Source language: bo
Languages: en

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་ཆོས་ཀྱི་དབྱིངས་ལ་སྤྱོད་པའི་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོས་ནི་ཆོས་ཐམས་ཅད་ལ་བསླབ་པར་འགྱུར་ཏེ།
en: VIII: 83} “Subhūti,” bodhisattva great beings who engage in the realm of phenomena will become trained in all phenomena,” replied the Blessed One. “

source: དེ་ཅིའི་ཕྱིར་ཞེ་ན། རབ་འབྱོར་འདི་ལྟར་ཆོས་ཐམས་ཅད་ནི་ཆོས་ཀྱི་དབྱིངས་སོ། །གསོལ་པ།
en: If you ask why, Subhūti, it is because all phenomena constitute the realm of phenomena.” “

source: །བཅོམ་ལྡན་འདས་ཅིའི་སླད་དུ་ཆོས་ཐམས་ཅད་ཆོས་ཀྱི་དབྱིངས་ལགས།
en: Blessed Lord, why do all phenomena constitute the realm of phenomena?” “

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ། རབ་འབྱོར་འདི་ལྟར་དེ་བཞིན་གཤེགས་པ་རྣམས་བྱུང་ཡང་རུང་། མ་བྱུང་ཡང་རུང་སྟེ། དབྱེར་མེད་པའི་ཚུལ་གྱིས་ཆོས་རྣམས་ཀྱི་ཆོས་ཀྱི་དབྱིངས་ནི་དེ་བཞིན་དུ་གནས་པ་སྟེ། རབ་འབྱོར་ཆོས་ཀྱི་དབྱིངས་ནི་འདི་ལྟ་སྟེ།
en: Subhūti,” replied the Blessed One, “whether the tathāgatas have appeared or whether they have not appeared, the realm of phenomena, of which all phenomena partake, itself dwells indivisibly.

source: དགེ་བ་དང་མི་དགེ་བའི་ཆོས་དང་། འཇིག་རྟེན་པ་དང་། འཇིག་རྟེན་ལས་འདས་པ་དང་། ཟག་པ་དང་བཅས་པ་དང་། ཟག་པ་མེད་པའི་ཆོས་དང་།
en: Subhūti, the realm of phenomena indeed comprises all phenomena—attributes that are virtuous and nonvirtuous; attributes that are mundane and supramundane, contaminated and uncontaminated; attributes that are inadmissible and admissible; and attributes that are conditioned and unconditioned.

source: ཁ་ན་མ་ཐོ་བ་དང་བཅས་པ་དང་། ཁ་ན་མ་ཐོ་བ་མེད་པའི་ཆོས་དང་། འདུས་བྱས་དང་འདུས་མ་བྱས་ཀྱི་ཆོས་ཐམས་ཅད་དེ། རབ་འབྱོར་དེ་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པས། ཆོས་ཀྱི་དབྱིངས་ལ་སློབ་པས་ཆོས་ཐམས་ཅད་ལ་བསླབ་པར་འགྱུར་རོ།
en: So it is, Subhūti, that bodhisattva great beings who practice the perfection of wisdom become trained in all phenomena by training in the realm of phenomena.” “

source: །གསོལ་པ་བཅོམ་ལྡན་འདས་གལ་ཏེ། ཆོས་ཐམས་ཅད་ཆོས་ཀྱི་དབྱིངས་ལགས་ན། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པས། ཇི་ལྟར་གཟུགས་ལ་བསླབ་པར་བགྱི།
en: Blessed Lord, if all phenomena constitute the realm of phenomena, in that case, how should bodhisattva great beings who practice the perfection of wisdom train in physical forms?

source: ཇི་ལྟར་ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་ལ་བསླབ་པར་བགྱི།
en: How should they train in feelings, perceptions, formative predispositions, and consciousness?

source: ཇི་ལྟར་སྐྱེ་མཆེད་དང་། ཁམས་དང་། རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་ལ་བསླབ་པར་བགྱི།
en: How should they train in the sense fields, the sensory elements, and the links of dependent origination?

source: ཇི་ལྟར་སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བསླབ་པར་བགྱི།
en: How should they train in the perfection of generosity?

source: ཇི་ལྟར་ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བསླབ་པར་བགྱི།
en: How should they train in the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative stability, and the perfection of wisdom?

source: ཇི་ལྟར་ནང་སྟོང་པ་ཉིད་ལ་བསླབ་པར་བགྱི།
en: How should they train in the emptiness of internal phenomena?

source: ཇི་ལྟར་དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་ལ་བསླབ་པར་བགྱི།
en: How should they train in [the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentity?

source: ཇི་ལྟར་དྲན་པ་ཉེ་བར་གཞག་པ་བཞི་ལ་བསླབ་པར་བགྱི། ཇི་ལྟར་ཡང་དག་པར་སྤོང་བ་བཞི་དང་།
en: How should they train in the four applications of mindfulness?

source: རྫུ་འཕྲུལ་གྱི་རྐང་པ་བཞི་དང་། དབང་པོ་ལྔ་དང་། སྟོབས་ལྔ་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་བདུན་དང་། འཕགས་པའི་ལམ་ཡན་ལག་བརྒྱད་པ་ལ་བསླབ་པར་བགྱི།
en: How should they train in the four correct exertions, the four supports for miraculous ability, the five faculties, the five powers, the seven branches of enlightenment, and the noble eightfold path?

source: ཇི་ལྟར་འཕགས་པའི་བདེན་པ་བཞི་དང་། བསམ་གཏན་བཞི་དང་། ཚད་མེད་པ་བཞི་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་བཞི་དང་། རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་དྲུག་དང་། ཏིང་ངེ་འཛིན་ཐམས་ཅད་དང་། གཟུངས་ཀྱི་སྒོ་ཐམས་ཅད་ལ་བསླབ་པར་བགྱི།
en: How should they train in the four truths of the noble ones, the four meditative concentrations, the four immeasurable attitudes, the four formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, emptiness, signlessness, wishlessness, the six extrasensory powers, all the meditative stabilities, and all the dhāraṇī gateways?

source: ཇི་ལྟར་དེ་བཞིན་གཤེགས་པའི་སྟོབས་བཅུ་དང་། མི་འཇིགས་པ་བཞི་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་བཞི་དང་། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། དགའ་བ་ཆེན་པོ་དང་།
en: How should they train in the ten powers of the tathāgatas, the four fearlessnesses, the four kinds of exact knowledge, great loving kindness, great compassion, great empathetic joy, great equanimity, and the eighteen distinct qualities of the buddhas?

source: བཏང་སྙོམས་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭོ་བརྒྱད་ལ་བསླབ་པར་བགྱི། ཇི་ལྟར་མི་ཆེན་པོའི་མཚན་སུམ་ཅུ་རྩ་གཉིས་དང་། དཔེ་བྱད་བཟང་པོ་བརྒྱད་ཅུ་ཡོངས་སུ་གྲུབ་པར་བགྱི་བ་ལ་བསླབ་པར་བགྱི།
en: How should they train in actualizing the thirty-two major marks of a great person, and the eighty excellent minor marks? “

source: ཇི་ལྟར་རྒྱལ་རིགས་ཆེ་ཞིང་མཐོ་བའི་རིགས་སུ་སྐྱེ་བར་བགྱི་བ་ལ་བསླབ་པར་བགྱི།
en: How should they train to achieve rebirth among great and lofty royal families?

source: ཇི་ལྟར་བྲམ་ཟེ་ཆེ་ཞིང་མཐོ་བའི་རིགས་དང་། ཁྱིམ་བདག་ཆེ་ཞིང་མཐོ་བའི་རིགས་སུ་སྐྱེ་བར་བགྱི་བ་ལ་བསླབ་པར་བགྱི།
en: How should they train to achieve rebirth among great and lofty priestly families, or among great and lofty householder families?

source: ཇི་ལྟར་རྒྱལ་ཆེན་བཞིའི་རིས་ཀྱི་ལྷར་སྐྱེ་བར་བགྱི་བ་དང་། སུམ་ཅུ་རྩ་གསུམ་དང་། མཚེ་མ་དང་། དགའ་ལྡན་དང་། འཕྲུལ་དགའ་དང་།
en: How should they train to be reborn in the god realm of Caturmahā­rāja­kāyika?

source: གཞན་འཕྲུལ་དབང་བྱེད་དང་། ཚངས་རིས་དང་། ཚངས་ལྷ་ཉེ་ཕན་དང་། ཚངས་པ་ཀུན་འཁོར་དང་། ཚངས་ཆེན་དང་།
en: How should they train to be reborn in the god realms of Trayastriṃśa, Yāma, Tuṣita, Nirmāṇarata, Para­nirmita­vaśa­vartin, Brahmakāyika, Brahmapurohita, Brahma­pariṣadya, Mahābrahmā, Ābha, Parīttābha, Apramāṇābha, Ābhāsvara, Śubha, Parīttaśubha, Apramāṇaśubha, Śubhakṛtsna, {Ki.

source: སྣང་བ་དང་། ཆུང་སྣང་དང་།
en: VIII: 84} Bṛhat, Parīttabṛhat, Apramāṇabṛhat, or Bṛhatphala?

source: ཚད་མེད་སྣང་བ་དང་།
en: How should they train to be reborn in the realms of nonperceptual beings?

source: ཀུན་སྣང་དང་བ་དང་དགེ་བ་དང་ཆུང་དགེ་དང་ཚད་མེད་དགེ་བ་དང་དགེ་རྒྱས་དང་ཆེ་བ་དང་ཆུང་ཆེ་དང་། ཚད་མེད་ཆེ་བ་དང་། འབྲས་བུ་ཆེ་བའི་ལྷར་སྐྱེ་བར་བགྱི་བ་ལ་བསླབ་པར་བགྱི། ཇི་ལྟར་འདུ་ཤེས་མེད་པའི་སེམས་ཅན་དུ་སྐྱེ་བར་བགྱི་བའི་སླད་དུ་བསླབ་པར་བགྱི། ཇི་ལྟར་གནས་གཙང་མའི་རིས་ཀྱི་ལྷར་སྐྱེ་བར་བགྱི་བ་ལ་བསླབ་ཅིང་དེར་ཡང་མི་སྐྱེ་བར་བགྱི།
en: How should they train to be reborn among the gods of the Pure Abodes—[Avṛha, Atapa, Sudṛśa, Sudarśana, and Akaniṣṭha]—and also how should they avoid being reborn in them?

source: ཇི་ལྟར་ནམ་མཁའ་མཐའ་ཡས་སྐྱེ་མཆེད་དང་། རྣམ་ཤེས་མཐའ་ཡས་སྐྱེ་མཆེད་དང་། ཅུང་ཟད་མེད་པའི་སྐྱེ་མཆེད་དང་། འདུ་ཤེས་མེད་འདུ་ཤེས་མེད་མིན་སྐྱེ་མཆེད་ཀྱི་ལྷར་སྐྱེ་བར་བགྱི་བ་ལ་བསླབ་ཅིང་དེར་ཡང་མི་སྐྱེ་བར་བགྱི།
en: How should they train to be reborn in the god realm of the sphere of infinite space, the sphere of infinite consciousness, the sphere of nothing-at-all, and the sphere of neither perception nor nonperception, and also how should they avoid being reborn in them? “

source: ཇི་ལྟར་སེམས་དང་པོ་བསྐྱེད་པ་ལ་བསླབ་པར་བགྱི།
en: How should they train in the first setting of their mind on enlightenment?

source: ཇི་ལྟར་སེམས་བསྐྱེད་པ་གཉིས་པ་དང་། གསུམ་པ་དང་བཞི་པ་དང་ལྔ་པ་དང་དྲུག་པ་དང་བདུན་པ་དང་བརྒྱད་པ་དང་དགུ་པ་དང་། སེམས་བསྐྱེད་པ་བཅུ་པ་ལ་བསླབ་པར་བགྱི།
en: How should they train in the second, the third, the fourth, the fifth, the sixth, the seventh, the eighth, the ninth, and the tenth setting of their mind on enlightenment?

source: ཇི་ལྟར་ཉན་ཐོས་ཀྱི་ས་དང་། རང་སངས་རྒྱས་ཀྱི་ས་ལ་བསླབ་པར་བགྱི།
en: How should they train in the level of the śrāvakas and the level of the pratyekabuddhas?

source: ཇི་ལྟར་བྱང་ཆུབ་སེམས་དཔའི་སྐྱོན་མ་མཆིས་པ་དང་། སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བགྱི་བ་དང་། སངས་རྒྱས་ཀྱི་ཞིང་ཡོངས་སུ་དག་པར་བགྱི་བ་ལ་བསླབ་པར་བགྱི།
en: How should they train in the maturity of the bodhisattvas, the maturation of beings, and the refinement of the buddhafields?

source: ཇི་ལྟར་བྱང་ཆུབ་ཀྱི་ལམ་ལ་བསླབས་ཤིང་། ཆོས་ཐམས་ཅད་རྣམ་པ་ཐམས་ཅད་དུ་འཚལ་བར་བགྱི་བའི་བྱང་ཆུབ་ཀྱི་ལམ་ལ་བསླབ་པར་བགྱི། བཅོམ་ལྡན་འདས་གལ་ཏེ་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པས། གཟུགས་ལ་བསླབ་པར་བགྱི། ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་ལ་བསླབ་པར་བགྱི། སྐྱེ་མཆེད་དང་། ཁམས་དང་། རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་ལ་བསླབ་པར་བགྱི། སྦྱིན་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བསླབ་པར་བགྱི། ཚུལ་ཁྲིམས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བཟོད་པའི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བརྩོན་འགྲུས་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། བསམ་གཏན་གྱི་ཕ་རོལ་དུ་ཕྱིན་པ་དང་། ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་བསླབ་པར་བགྱི། ནང་སྟོང་པ་ཉིད་ལ་བསླབ་པར་བགྱི། དངོས་པོ་མེད་པའི་ངོ་བོ་ཉིད་སྟོང་པ་ཉིད་ཀྱི་བར་ལ་བསླབ་པར་བགྱི། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་ལ་བསླབ་པར་བགྱི། འཕགས་པའི་བདེན་པ་རྣམས་དང་། བསམ་གཏན་རྣམས་དང་། ཚད་མེད་པ་རྣམས་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་། རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་རྣམས་དང་། ཏིང་ངེ་འཛིན་རྣམས་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་ལ་བསླབ་པར་བགྱི། དེ་བཞིན་གཤེགས་པའི་སྟོབས་རྣམས་དང་། མི་འཇིགས་པ་རྣམས་དང་།
en: How should they train in the path of enlightenment whereby those who have trained in it investigate all phenomena in all their aspects? “

source: སོ་སོ་ཡང་དག་པར་རིག་པ་རྣམས་དང་། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་ལ་བསླབ་པར་བགྱི། རྒྱུན་དུ་ཞུགས་པའི་འབྲས་བུ་དང་། ལན་ཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ་དང་། ཕྱིར་མི་འོང་བའི་འབྲས་བུ་ལ་བསླབ་པར་བགྱི། དགྲ་བཅོམ་པ་ཉིད་དང་། རང་བྱང་ཆུབ་ལ་བསླབ་པར་བགྱི། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་ལ་བསླབ་པར་བགྱི།
en: Blessed Lord, if bodhisattva great beings who practice the perfection of wisdom should train in physical forms; should train in feelings, perceptions, formative predispositions, and consciousness; should train in the sense fields, the sensory elements, and the links of dependent origination; should train in the perfection of generosity; should train in the perfection of ethical discipline, the perfection of tolerance, the perfection of perseverance, the perfection of meditative stability, and the perfection of wisdom; should train in the emptiness of internal phenomena; should train in [the other aspects of emptiness], up to and including the emptiness of the essential nature of nonentity; should train in the thirty-seven factors conducive to enlightenment; should train in the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the meditative stabilities, and the dhāraṇī gateways; should train in the powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, great loving kindness, great compassion, and the distinct qualities of the buddhas; should train in the fruit of entering the stream to nirvāṇa, the fruit of being destined for only one more rebirth, and the fruit of no longer being subject to rebirth; should train in arhatship and individual enlightenment; and should train in [the goals], up to and including all-aspect omniscience, one might wonder, Blessed Lord, why bodhisattva great beings do not resort to erroneous practices nor elaborate unpleasant thoughts? “

source: བཅོམ་ལྡན་འདས་དེའི་སླད་དུ། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཕྱིན་ཅི་ལོག་ལ་སྤྱོད་པ་འམ། མི་སྤྲོ་བ་སྤྲོས་པར་བགྱིད་པར་མི་འགྱུར་བ་ལགས་གྲང་། བཅོམ་ལྡན་འདས་དེ་ཅིའི་སླད་དུ་ཞེ་ན། ཆོས་ཀྱི་དབྱིངས་ལ་ནི་རྣམ་པར་རྟོག་པ་དེ་དག་མ་མཆིས་ཏེ།
en: If one were to wonder why, Blessed Lord, it is because these false imaginations do not exist in this realm of phenomena.

source: གཟུགས་ཀྱང་ཆོས་ཀྱི་དབྱིངས་མ་ལགས། གཟུགས་ལས་གུད་ན་ཡང་ཆོས་ཀྱི་དབྱིངས་མ་མཆིས་ཏེ།
en: Physical forms do not constitute the realm of phenomena, nor does the realm of phenomena exist apart from physical forms.

source: གཟུགས་ཉིད་ཀྱང་ཆོས་ཀྱི་དབྱིངས་སོ། །ཆོས་ཀྱི་དབྱིངས་ཉིད་ཀྱང་གཟུགས་སོ།
en: Physical forms simply are the realm of phenomena, and the realm of phenomena simply is physical forms.

source: །ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པར་ཡང་ཆོས་ཀྱི་དབྱིངས་མ་ལགས། རྣམ་པར་ཤེས་པ་ལས་གུད་ན་ཡང་ཆོས་ཀྱི་དབྱིངས་མ་མཆིས་ཏེ།
en: Feelings, perceptions, formative predispositions, and consciousness do not constitute the realm of phenomena, nor does the realm of phenomena exist apart from consciousness [and so forth].

source: རྣམ་པར་ཤེས་པ་ཉིད་ཀྱང་ཆོས་ཀྱི་དབྱིངས་སོ། །ཆོས་ཀྱི་དབྱིངས་ཉིད་ཀྱང་རྣམ་པར་ཤེས་པའོ།
en: Consciousness [and so forth] simply are the realm of phenomena, and the realm of phenomena simply is consciousness [and so forth].

source: །སྐྱེ་མཆེད་དང་། ཁམས་དང་། རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་ཡང་ཆོས་ཀྱི་དབྱིངས་མ་ལགས། རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་ལས་གུད་ན་ཡང་ཆོས་ཀྱི་དབྱིངས་མ་མཆིས་ཏེ།
en: The sense fields, the sensory elements, and the links of dependent origination do not constitute the realm of phenomena, nor does the realm of phenomena exist apart from the links of dependent origination [and so forth].

source: རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་ཉིད་ཀྱང་ཆོས་ཀྱི་དབྱིངས་སོ། །ཆོས་ཀྱི་དབྱིངས་ཉིད་ཀྱང་རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བའོ།
en: The links of dependent origination [and so forth] simply are the realm of phenomena, and the realm of phenomena simply is the links of dependent origination [and so forth].

source: །ཕ་རོལ་དུ་ཕྱིན་པ་རྣམས་དང་། སྟོང་པ་ཉིད་ཐམས་ཅད་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་ཡང་ཆོས་ཀྱི་དབྱིངས་མ་ལགས། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་ལས་གུད་ན་ཡང་ཆོས་ཀྱི་དབྱིངས་མ་མཆིས་ཏེ། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་ཉིད་ཀྱང་ཆོས་ཀྱི་དབྱིངས་སོ།
en: The perfections, all the aspects of emptiness, and the thirty-seven factors conducive to enlightenment do not constitute the realm of phenomena, nor does the realm of phenomena exist apart from the thirty-seven factors conducive to enlightenment [and so forth].

source: །ཆོས་ཀྱི་དབྱིངས་ཉིད་ཀྱང་བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རྣམས་སོ། །འཕགས་པའི་བདེན་པ་རྣམས་དང་། བསམ་གཏན་རྣམས་དང་།
en: The factors conducive to enlightenment [and so forth] simply are the realm of phenomena, and the realm of phenomena simply is the factors conducive to enlightenment [and so forth].

source: ཚད་མེད་པ་རྣམས་དང་གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་། རྣམ་པར་ཐར་པ་རྣམས་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་རྣམས་དང་། ཏིང་ངེ་འཛིན་རྣམས་དང་།
en: The truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the aspects of liberation, the serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the meditative stabilities, and the dhāraṇī gateways do not constitute the realm of phenomena, nor does the realm of phenomena exist apart from the dhāraṇī gateways [and so forth].

source: གཟུངས་ཀྱི་སྒོ་རྣམས་ཀྱང་ཆོས་ཀྱི་དབྱིངས་མ་ལགས། གཟུངས་ཀྱི་སྒོ་རྣམས་ལས་གུད་ན་ཡང་ཆོས་ཀྱི་དབྱིངས་མ་ལགས་ཏེ། གཟུངས་ཀྱི་སྒོ་ཉིད་ཀྱང་ཆོས་ཀྱི་དབྱིངས་སོ། །ཆོས་ཀྱི་དབྱིངས་ཉིད་ཀྱང་གཟུངས་ཀྱི་སྒོ་རྣམས་སོ། །དེ་བཞིན་གཤེགས་པའི་སྟོབས་རྣམས་དང་།
en: The dhāraṇī gateways [and so forth] simply are the realm of phenomena, and the realm of phenomena simply is the dhāraṇī gateways [and so forth].

source: མི་འཇིགས་པ་རྣམས་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་རྣམས་དང་། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་ཀྱང་ཆོས་ཀྱི་དབྱིངས་མ་ལགས།
en: The powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, great loving kindness, great compassion, and the distinct qualities of the buddhas do not constitute the realm of phenomena, nor does the realm of phenomena exist apart from the distinct qualities of the buddhas [and so forth].

source: སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་ལས་གུད་ན་ཡང་ཆོས་ཀྱི་དབྱིངས་མ་མཆིས་ཏེ། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་ཉིད་ཀྱང་ཆོས་ཀྱི་དབྱིངས་སོ། །ཆོས་ཀྱི་དབྱིངས་ཉིད་ཀྱང་སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་སོ། །རྒྱུན་ཏུ་ཞུགས་པའི་འབྲས་བུ་དང་།
en: The distinct qualities of the buddhas [and so forth] simply are the realm of phenomena, and the realm of phenomena simply is the distinct qualities of the buddhas [and so forth].

source: ལན་ཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ་དང་། ཕྱིར་མི་འོང་བའི་འབྲས་བུ་དང་། དགྲ་བཅོམ་པ་ཉིད་དང་། རང་བྱང་ཆུབ་ཀྱང་ཆོས་ཀྱི་དབྱིངས་མ་ལགས། རང་བྱང་ཆུབ་ལས་གུད་ན་ཆོས་ཀྱི་དབྱིངས་མ་མཆིས་ཏེ།
en: The fruit of entering the stream to nirvāṇa, the fruit of being destined for only one more rebirth, the fruit of no longer being subject to rebirth, arhatship, and individual enlightenment do not constitute the realm of phenomena, nor does the realm of phenomena exist apart from individual enlightenment [and so forth].

source: རང་བྱང་ཆུབ་ཉིད་ཀྱང་ཆོས་ཀྱི་དབྱིངས་སོ། །ཆོས་ཀྱི་དབྱིངས་ཉིད་ཀྱང་རང་བྱང་ཆུབ་བོ།
en: Individual enlightenment [and so forth] simply are the realm of phenomena, and the realm of phenomena simply is individual enlightenment [and so forth]. [

source: །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་ཡང་ཆོས་ཀྱི་དབྱིངས་མ་ལགས། རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ལས་གུད་ན་ཡང་ཆོས་ཀྱི་དབྱིངས་མ་མཆིས་ཏེ།
en: The goals], up to and including all-aspect omniscience, do not constitute the realm of phenomena, nor does the realm of phenomena exist apart from all-aspect omniscience [and so forth].

source: རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱང་ཆོས་ཀྱི་དབྱིངས་སོ། །ཆོས་ཀྱི་དབྱིངས་ཉིད་ཀྱང་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དོ། །བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: All-aspect omniscience [and so forth] simply are the realm of phenomena, and the realm of phenomena simply is all-aspect omniscience [and so forth].” “

source: ཇི་སྐད་དུ་སྨྲས་པ་དེ་དེ་བཞིན་ནོ།
en: It is just as you have said.

source: །གཟུགས་ཉིད་ཀྱང་ཆོས་ཀྱི་དབྱིངས་སོ།
en: All these false imaginations do not exist in the realm of phenomena.

source: །ཆོས་ཀྱི་དབྱིངས་ཉིད་ཀྱང་གཟུགས་སོ།
en: Physical forms simply are the realm of phenomena, and the realm of phenomena simply is physical forms.

source: །ཚོར་བ་དང་། འདུ་ཤེས་དང་། འདུ་བྱེད་དང་། རྣམ་པར་ཤེས་པ་ཉིད་ཀྱང་ཆོས་ཀྱི་དབྱིངས་སོ། །ཆོས་ཀྱི་དབྱིངས་ཉིད་ཀྱང་རྣམ་པར་ཤེས་པའོ།
en: Feelings, perceptions, formative predispositions, and consciousness simply are the realm of phenomena, and the realm of phenomena simply is consciousness [and so forth].

source: །སྐྱེ་མཆེད་དང་ཁམས་དང་། རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་ཉིད་ཀྱང་ཆོས་ཀྱི་དབྱིངས་སོ། །ཆོས་ཀྱི་དབྱིངས་ཉིད་ཀྱང་རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བའོ། །ཕ་རོལ་དུ་ཕྱིན་པ་རྣམས་དང་།
en: The sense fields, the sensory elements, and the links of dependent origination simply are the realm of phenomena, and the realm of phenomena simply is the links of dependent origination [and so forth].

source: སྟོང་པ་ཉིད་ཐམས་ཅད་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་ཉིད་ཀྱང་ཆོས་ཀྱི་དབྱིངས་སོ། །ཆོས་ཀྱི་དབྱིངས་ཉིད་ཀྱང་བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་རྣམས་སོ། །འཕགས་པའི་བདེན་པ་དང་། བསམ་གཏན་དང་། ཚད་མེད་པ་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་དང་། རྣམ་པར་ཐར་པ་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དང་། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་།
en: The perfections, all the aspects of emptiness, and the thirty-seven factors conducive to enlightenment simply are the realm of phenomena, and the realm of phenomena simply is the factors conducive to enlightenment [and so forth].

source: སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་དང་། ཏིང་ངེ་འཛིན་དང་། གཟུངས་ཀྱི་སྒོ་ཉིད་ཀྱང་ཆོས་ཀྱི་དབྱིངས་སོ། །ཆོས་ཀྱི་དབྱིངས་ཉིད་ཀྱང་གཟུངས་ཀྱི་སྒོ་རྣམས་སོ། །དེ་བཞིན་གཤེགས་པའི་སྟོབས་དང་།
en: The truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the aspects of liberation, the serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the meditative stabilities, and the dhāraṇī gateways simply are the realm of phenomena, and the realm of phenomena simply is the dhāraṇī gateways [and so forth].

source: མི་འཇིགས་པ་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་དང་། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་། སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་ཉིད་ཀྱང་ཆོས་ཀྱི་དབྱིངས་སོ། །ཆོས་ཀྱི་དབྱིངས་ཉིད་ཀྱང་སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་རྣམས་སོ།
en: The powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, great loving kindness, great compassion, and the distinct qualities of the buddhas simply are the realm of phenomena, and the realm of phenomena simply is the distinct qualities of the buddhas [and so forth].

source: །རྒྱུན་ཏུ་ཞུགས་པའི་འབྲས་བུ་དང་། ལན་ཅིག་ཕྱིར་འོང་བའི་འབྲས་བུ་དང་། ཕྱིར་མི་འོང་བའི་འབྲས་བུ་དང་། དགྲ་བཅོམ་པ་ཉིད་དང་། རང་བྱང་ཆུབ་ཉིད་ཀྱང་ཆོས་ཀྱི་དབྱིངས་སོ།
en: The fruit of entering the stream to nirvāṇa, the fruit of being destined for only one more rebirth, the fruit of no longer being subject to rebirth, arhatship, and individual enlightenment simply are the realm of phenomena, and the realm of phenomena simply is individual enlightenment [and so forth]. [

source: །ཆོས་ཀྱི་དབྱིངས་ཉིད་ཀྱང་རང་བྱང་ཆུབ་བོ། །རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་བར་ཡང་ཆོས་ཀྱི་དབྱིངས་སོ།
en: The goals], up to and including all-aspect omniscience, simply are the realm of phenomena, and the realm of phenomena simply is all-aspect omniscience [and so forth]. “

source: །ཆོས་ཀྱི་དབྱིངས་ཉིད་ཀྱང་རྣམ་པ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དོ། །རབ་འབྱོར་གལ་ཏེ་ཡང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། ཆོས་ཀྱི་དབྱིངས་ལ་མ་གཏོགས་པའི་ཆོས་འགའ་ཞིག་མཐོང་ན་ནི། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལ་གནས་པར་ཡང་མི་འགྱུར་ཏེ།
en: Subhūti, when bodhisattva great beings practice the perfection of wisdom, if they were to see anything apart from the realm of phenomena, then they would not be intent on unsurpassed, complete enlightenment.

source: ཆོས་ཐམས་ཅད་ནི་ཆོས་ཀྱི་དབྱིངས་ཡིན་པས།
en: All phenomena are the realm of phenomena.

source: དེའི་ཕྱིར་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཤེས་རབ་ཀྱི་ཕ་རོལ་དུ་ཕྱིན་པ་ལ་སྤྱོད་པའི་ཚེ། ཆོས་ཐམས་ཅད་ནི་ཆོས་ཀྱི་དབྱིངས་སུ་ཤེས་ནས།
en: This is why, when bodhisattva great beings practice the perfection of wisdom, they know all phenomena to be the realm of phenomena, {Ki.

source: ཆོས་ཐམས་ཅད་མིང་མེད་པ་ལ་མིང་གི་བརྡས་ཆོས་སྟོན་ཏེ། འདི་ནི་གཟུགས་ཞེས་བྱའོ།
en: VIII: 85} and can then teach the Dharma by attributing to all those nameless phenomena the symbolic convention of names, as follows: ‘These are physical forms.’ ‘

source: །འདི་ནི་ཚོར་བ་དང་འདུ་ཤེས་དང་འདུ་བྱེད་དང་། །རྣམ་པར་ཤེས་པ་ཞེས་བྱའོ།
en: These are feelings, perceptions, formative predispositions, and consciousness.’ ‘

source: །འདི་དག་ནི་སྐྱེ་མཆེད་དང་། ཁམས་དང་རྟེན་ཅིང་འབྲེལ་པར་འབྱུང་བ་ཞེས་བྱའོ། །འདི་དག་ནི་ཕ་རོལ་དུ་ཕྱིན་པ་རྣམས་དང་།
en: These are the sense fields, the sensory elements, and the links of dependent origination.’ ‘

source: སྟོང་པ་ཉིད་ཐམས་ཅད་དང་། བྱང་ཆུབ་ཀྱི་ཕྱོགས་ཀྱི་ཆོས་སུམ་ཅུ་རྩ་བདུན་ཞེས་བྱའོ། །འདི་དག་ནི་འཕགས་པའི་བདེན་པ་རྣམས་དང་། བསམ་གཏན་རྣམས་དང་། ཚད་མེད་པ་རྣམས་དང་། གཟུགས་མེད་པའི་སྙོམས་པར་འཇུག་པ་རྣམས་དང་།
en: These are the perfections, all the aspects of emptiness, and the thirty-seven factors conducive to enlightenment.’ ‘

source: རྣམ་པར་ཐར་པ་བརྒྱད་དང་། མཐར་གྱིས་གནས་པའི་སྙོམས་པར་འཇུག་པ་དགུ་དང་། སྟོང་པ་ཉིད་དང་། མཚན་མ་མེད་པ་དང་། སྨོན་པ་མེད་པ་དང་། མངོན་པར་ཤེས་པ་དང་། ཏིང་ངེ་འཛིན་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་ཞེས་བྱའོ།
en: These are the truths of the noble ones, the meditative concentrations, the immeasurable attitudes, the formless absorptions, the eight aspects of liberation, the nine serial steps of meditative absorption, emptiness, signlessness, wishlessness, the extrasensory powers, the meditative stabilities, and the dhāraṇī gateways.’ ‘

source: །འདི་དག་ནི་དེ་བཞིན་གཤེགས་པའི་སྟོབས་རྣམས་དང་། མི་འཇིགས་པ་རྣམས་དང་། སོ་སོ་ཡང་དག་པར་རིག་པ་རྣམས་དང་། བྱམས་པ་ཆེན་པོ་དང་། སྙིང་རྗེ་ཆེན་པོ་དང་།
en: These are the powers of the tathāgatas, the fearlessnesses, the kinds of exact knowledge, great loving kindness, great compassion, and the distinct qualities of the buddhas.’ ‘
